//У вас есть массив строк 
const strings = ["plan-0", "plan-1", "plan-2"];

//1 ваше задача - вывести в консоль каждую строку, но отрезав слово "план-". т е должны быть только цифры

//2 ваша задача - вывести в консоль цифру от названия плана, если она совпадает с переменной currentPlan
let currentPlan = 1;
//т е выведется только цифра 1, потому что в "plan-1" цифра 1 совпадает с currentPlan

//3 ваша задача - вывести в консоль цифру от названия плана, если она совпадает с переменной, которую принимает функция

function checkPlanName(number) {
    //ваш код тут
}

checkPlanName(0); //выведет 0
checkPlanName(1);  //выведет 1
checkPlanName(2);  // выведет 2
